modules/admin/controllers/ArticleController.php

INSERT INTO `article` (`title`, `description`, `content`, `date`) VALUES ('Название 2', 'Описание 2', 'Контент 2', '2018-10-25')
---
    public function actionCreate()
    {
        $model = new Article();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `article` WHERE `id`='10'
---
    protected function findModel($id)
    {
        if (($model = Article::findOne($id)) !== null) {

SELECT * FROM `category`
---
    public function actionSetCategory($id)
    {
        $article = $this->findModel($id);
        $selectedCategory = ($article->category) ? $article->category->id : '0';
        $categories = ArrayHelper::map(Category::find()->all(), 'id', 'title');