controllers/SiteController.php

SELECT * FROM `article` WHERE `id`='1'
---
    public function actionView($id)
    {
        $article = Article::findOne($id);