models/Article.php

    public function saveCategory($category_id)
    {
        $category = Category::findOne($category_id);
---
SELECT * FROM `category` WHERE `id`='1'

    public static function getPopular()
    {
        return Article::find()->orderBy('viewed desc')->limit(3)->all();
---
SELECT * FROM `article` ORDER BY `viewed` DESC LIMIT 3

    public static function getRecent()
    {
        return Article::find()->orderBy('date desc')->limit(4)->all();
---
SELECT * FROM `article` ORDER BY `date` DESC LIMIT 4