models/Category.php

    public function getArticlesCount()
    {
        return $this->getArticles()->count();
---
SELECT COUNT(*) FROM `article` WHERE `category_id`=1

    public static function getAll()
    {

        return Category::find()->all();
---
SELECT * FROM `category`